#include "Header.h"

int list() {
	std::cout << "Введите номер задачи, которую хотите проверить...\n\n";
	std::cout << " №1. Простой вывод\n №2. Переменные int и double\n №3. Арифметика для разных типов\n №4. Обмен значениями\n №5. Падение объекта\n";
	std::cout << " №6. Корни уравнения\n №7. Площадь треугольника\n №8. Калькулятор\n №9. Угадай число\n №10. Возведение в степень\n";
	std::cout << " №11. Факториал\n №12. Простое число\n №13. Степень двойки\n №14. Фиксированная сумма\n";
	std::cout << " №16. Факторизация натурального числа\n №17. Индекс массы тела\n №18. Min и Max в одномерном массиве\n №19. Количество цифр\n №20. Сортировка пузырьком\n\n";
	
	return 0;
}