#include "Header.h"

int sixth() {
	setlocale(LC_ALL, "Russian");

	std::cout << "\n\n№6.Корни уравнения\n\n";
	double a, b, c, D, x_1, x_2;  //a, b и c - коэффициенты, D - дискриминант, x_1 и x_2 - корни уравнения

	std::cout << "Дано квадратное уравнение: ax^2 + bx + c = 0.\n" << "Введите значения коэффициентов a, b и c:\n";
	std::cout << "a = "; std::cin >> a;
	std::cout << "b = "; std::cin >> b;
	std::cout << "c = "; std::cin >> c;

	D = b * b - 4 * a * c;

	//Если первый коэффициент равен нулю
	if (a == 0) {
		if (b == 0) {
			//Если все коэффициенты равны нулю
			if (c == 0) {
				std::cout << "Корнец бесконечное множество\n";
			}
			//Если первый и второй коэффициент равны нулю
			else {
				std::cout << "Уравнение не имеет корней, так как " << c << " != 0" << "\n";
			}
		}
		//Если первый и третий коэффициенты равны нулю
		else if (c == 0) {
			std::cout << "Корень уравнения равен нулю\n";
		}
		else {
			x_1 = (-c) / b;

			std::cout << "Корень уравнения равен " << x_1 << "\n";
		}
	}
	//Если второй коэффициент равен нулю
	else if (b == 0) {
		//Если второй и третий коэффициент равны нулю
		if (c == 0) {
			std::cout << "Корень уравнения равен нулю\n";
		}
		else {
			if (((-c) / a) >= 0) {
				x_1 = sqrt((-c) / a);

				std::cout << "Корень уравнения равен " << x_1 << "\n";
			}
			else std::cout << "Нет решений\n";
		}
	}
	//Если третий коэффициент равен нулю
	else if (c == 0) {
		x_1 = 0;
		x_2 = (-b) / a;

		std::cout << "Первый корень уравнения равен " << x_1 << "\nВторой корень уравнения равен " << x_2 << "\n";
	}
	//Если дискриминант равен нулю
	else if (D == 0) {
		x_1 = (-b) / (2 * a);
		std::cout << "Дискриминант равен нулю. Корень уравнения равен " << x_1 << "\n";
	}
	//Если дискриминант отрицателен
	else if (D < 0) {
		std::cout << "Дискриминант отрицательный, корней нет.";
	}
	//Если дискриминант положителен
	else if (D > 0) {
		x_1 = ((-b) + sqrt(D)) / (2 * a);
		x_2 = ((-b) - sqrt(D)) / (2 * a);

		std::cout << "Первый корень уравнения равен " << x_1 << "\nВторой корень уравнения равен " << x_2 << "\n";
	}

	return 0;
}